In [1]:
import numpy as np
import pandas as pd

In [3]:
dct = {'one':[10, np.nan, 30], 'two':[np.nan, np.nan, 50], 'three':[10, 10, 10]}

In [4]:
df = pd.DataFrame(dct)
df

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  50.0     10

In [5]:
df.dropna()

    one   two  three
2  30.0  50.0     10

In [6]:
df.dropna(axis=1)

   three
0     10
1     10
2     10

In [7]:
df.dropna(thresh=2)

    one   two  three
0  10.0   NaN     10
2  30.0  50.0     10

In [8]:
df.dropna(thresh=1)

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  50.0     10

In [9]:
df.fillna(value=0)

    one   two  three
0  10.0   0.0     10
1   0.0   0.0     10
2  30.0  50.0     10

In [10]:
df

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  50.0     10

In [11]:
df['two'].fillna(df['two'].mean())

0    50.0
1    50.0
2    50.0
Name: two, dtype: float64

In [12]:
df['one'].fillna(df['one'].mean())

0    10.0
1    20.0
2    30.0
Name: one, dtype: float64

In [13]:
df

    one   two  three
0  10.0   NaN     10
1   NaN   NaN     10
2  30.0  50.0     10